#ifndef CONFIG_H
#define CONFIG_H

// ============================================================
//  ПИНЫ КНОПОК
// ============================================================
#define BTN_SPEED_MINUS 43
#define BTN_AUTO        41
#define BTN_SPEED_PLUS  39
#define BTN_OFF         37
#define BTN_DUAL        35
#define BTN_POWER       33
#define BTN_REC         31
#define BTN_DEFROST     29
#define BTN_AC          27
#define BTN_RR_DEF      25
#define BTN_MODE        23

// ============================================================
//  ПИНЫ ИНДИКАТОРОВ
// ============================================================
#define IND_REC        49
#define IND_DUAL       44
#define IND_DEFROST    47
#define IND_AUTO       45
#define IND_RR_DEF     46

// ============================================================
//  ПИНЫ ЭНКОДЕРОВ
// ============================================================
#define ENC_PASS_A A9
#define ENC_PASS_B A8
#define ENC_VOL_A  19
#define ENC_VOL_B  18
#define ENC_DRV_A  20
#define ENC_DRV_B  21

// ============================================================
//  ПИНЫ ДЛЯ 0x66 (I-B DATA / GA-NET)
// ============================================================
#define FRAME_PIN   3
#define CONTROL_A   5

// ============================================================
//  РАЗМЕРЫ ПАКЕТОВ
// ============================================================
#define CLIMAT_MSG_LEN 16   // Длина пакета 0x98 (колбек от Navi)
#define CLIMAT_CMD_LEN 13   // Длина пакета 0x66 (команда в Navi)

// ============================================================
//  NTC (температура салона)
// ============================================================
#define NTC_PIN A15

// ============================================================
//  НАСТРОЙКИ КНОПОК
// ============================================================
#define DEBOUNCE_DELAY 50   // Задержка антидребезга (мс)

// TEMPERATURE
#define DEFAULT_PASS_TEMP 25
#define DEFAULT_DRV_TEMP  25

#endif