#ifndef TABLES_H
#define TABLES_H

#include <Arduino.h>

// ============================================================
//  ТАБЛИЦА КОМАНД РЕЖИМОВ
// ============================================================
extern const uint16_t modeCommands[];
extern const char* modeNames[];

// ============================================================
//  ТАБЛИЦА КОМАНД СКОРОСТЕЙ
// ============================================================
extern const uint16_t fanCommands[];

// ============================================================
//  ТАБЛИЦА СКОРОСТЕЙ, ТЕМПЕРАТУР И КНОПОК
// ============================================================

extern const byte tempHVACtoAndroid[][4];
extern const byte keyCode[][3];
extern byte packet[6];

#endif